Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FamilySymbolNestingElementsError
The fitting family contains unsupported nested elements or sub-elements. Please update the routing preference by selecting a different fitting type.